app/Http/Controllers/LinhkienController.php

    public function index()
    {
        $linhkienData = [];
        $linhkienData['title'] = 'Car Parts';
        $linhkienData['products'] = Sanpham::all();
---
select * from `sanphams`