app/Http/Controllers/ProductController.php

    public function index()
    {
        $storeData = [];
        $storeData['title'] = 'Store/index';
        $storeData['subtitle'] = 'List of stores';
        $storeData['stores'] = Product::get()->sortBy('Name')->all();
        $storeData['selectedResults'] = Product::all();
---
select * from `products`

    public function filterStores(Request $request)
    {
        $storeData = [];
        $storeData['title'] = 'Store/index';
        $storeData['subtitle'] = 'List of stores';
        $storeData['stores'] = Product::get()->sortBy('Name')->all();
        $selectedCategory = $request->input('selectedCategory');

        if ($selectedCategory && $selectedCategory !== '0') {
        $storeData['selectedResults'] = Product::where('category', array($selectedCategory))->get();
---
select * from `products`
select * from `products` where `category` = 'Aston Martin'

    public function show($id)
    {
        $storeData = [];
        $storeItem = Product::findOrFail($id);
---
select * from `products` where `products`.`id` = '2' limit 1